{
    "projects": [
        {
            "id": "quiz-app",
            "title": "Flutter Based Quiz App",
            "link": "projects/flutterquizapp.html",
            "image": "images/project_imgs/buzz5_anim.png",
            "alt": "Quiz App Thumbnail"
        },
        {
            "id": "wordle-helper",
            "title": "Wordle Helper",
            "link": "projects/wordlehelper.html",
            "image": "images/project_imgs/wordlehelperanim.png",
            "alt": "Wordle Helper Thumbnail"
        },
        {
            "id": "bill-splitter",
            "title": "T-Mobile Family Bill Splitter",
            "link": "projects/mobilefamilybill.html",
            "image": "images/project_imgs/tmobilebill_ss.png",
            "alt": "Bill Splitter Thumbnail"
        },
        {
            "id": "bike-optimization",
            "title": "Bike Sharing System Optimization",
            "link": "projects/bikeoptimization.html",
            "image": "images/project_imgs/bikeopti_ss.png",
            "alt": "Bike Optimization Thumbnail"
        },
        {
            "id": "human-activity",
            "title": "Human Activity Recognition",
            "link": "projects/humanactivity.html",
            "image": "images/project_imgs/humanactivity.png",
            "alt": "Human Activity Recognition Thumbnail"
        },
        {
            "id": "smartphone-price",
            "title": "Smartphone Price Prediction",
            "link": "projects/smartphonepricer.html",
            "image": "images/project_imgs/smartphoneprice.png",
            "alt": "Smartphone Price Prediction Thumbnail"
        }
    ],
    "education": [
        {
            "school": "Purdue University, Krannert school of Management, West Lafayette",
            "school_url": "https://business.purdue.edu/undergraduate/academics/business-analytics-and-information-management.php",
            "period": "2021 - 2022",
            "image": "images/edu_interest_imgs/purdue_pic.jpg",
            "description": "My days wrestling with Excel sheets at AB InBev planted a seed, but it took some pandemic-induced soul-searching to realize I was obsessed with turning numbers into stories. Purdue became my gateway to data science, calling me across the ocean for ten months of intense learning among brilliant global peers. The cherry on top was landing a coveted Data Scientist role at BCG. From fixing brewery floors in India to New York consulting towers, it's been a wild ride. The takeaway? Never stop learning."
        },
        {
            "school": "BITS Pilani, Pilani campus",
            "school_url": "https://www.bits-pilani.ac.in/pilani/mechanical-engineering/",
            "period": "2015 - 2019",
            "image": "images/edu_interest_imgs/bits.png",
            "description": "BITS was a blur of Mechanical Engineering, a Finance minor, and leading 32 engineers to build ATVs that could handle anything but my driving. Between the cultural events, parties, and the 'organized chaos' of the BAJA team, I somehow graduated into a dream gig at the Budweiser brewery. It taught me the most important rule: always enjoy the work and the people you do it with."
        },
        {
            "school": "St. Mary's Convent Sr. Secondary School, Ujjain",
            "school_url": "http://www.stmarysujjain.in/fsma/Default.html",
            "period": "2001 - 2015",
            "image": "images/edu_interest_imgs/school_front.jpeg",
            "description": "For 14 years, this place gave me lifelong friends and mentors, even if I was just the kid with 'potential' rather than results. Then came the surprise: I somehow scored the highest in the school during my board exams. That boost was exactly what I needed to navigate India's competitive entrance exams and secure my ticket to BITS Pilani. The takeaway? Confidence is king!"
        }
    ],
    "work": [
        {
            "company": "CVS Health",
            "company_url": "https://www.cvshealth.com/",
            "role": "Senior Data Scientist",
            "period": "Aug 2024 - Present",
            "image": "images/company_logos/cvs_logo.svg",
            "tasks": [
                "Built and deployed a predictive analytics model to identify at-risk customers with 80% accuracy, enabling proactive retention campaigns and operational improvements to prevent customer churn",
                "Created Generative AI-powered system to automatically analyze pharmacy order delay patterns, reducing time to identify root causes from >1 hour to less than 5 minutes per case and accelerating operational improvements",
                "Created a machine learning system to predict business interruptions with >70% accuracy using operational patterns, enabling proactive resource planning and reducing operational disruptions by 30%"
            ]
        },
        {
            "company": "Boston Consulting Group",
            "company_url": "https://www.bcg.com/x/",
            "role": "Data Scientist",
            "period": "Jun 2022 - Aug 2024",
            "image": "images/company_logos/bcg_logo.png",
            "tasks": [
                "Led the design and implementation of an explainability model for demand forecasts (using permutation importance), increasing stakeholder trust and improving supply planning and financial decisions for a multi-billion dollar CPG client",
                "Developed proprietary modeling tool to measure incremental business impact from strategic initiatives using a Synthetic Control, informing client market expansion decisions",
                "Built and deployed Gurobi-based network optimization model for national logistics provider, informing infrastructure and workforce strategy with projected $5B in 10-year cost savings",
                "Managed 5-member analytics team to develop Prophet time-series models predicting credit card spend across 1,500+ US firms, achieving 18% WMAPE and outperforming baseline by 6%",
                "Designed AnyLogic simulation of mine-to-port operations to identify bottlenecks and optimize port utilization, delivering recommendations that enabled $10M+ supply chain cost reduction for a major mining company"
            ]
        },
        {
            "company": "AB InBev",
            "company_url": "https://www.ab-inbev.com/what-we-do",
            "role": "Assistant Manager",
            "period": "Jun 2019 - Oct 2020",
            "image": "images/company_logos/abinbev_logo.png",
            "tasks": [
                "Predicted early stage alcohol content using regression, boosting Budweiser production line's service level accuracy by 12%",
                "Coordinated cross-functional execution of $500K capital expenditure project, serving as primary liaison between internal departments and external suppliers to ensure on-time delivery"
            ]
        }
    ],
    "internships": [
        {
            "company": "Undisclosed Industry Partner (worker safety solutions company)",
            "company_url": "https://www.youtube.com/watch?v=dQw4w9WgXcQ",
            "role": "Student Data Scientist Consultant",
            "period": "Jan 2022 - May 2022",
            "image": "images/company_logos/undisclosed_logo.webp",
            "tasks": [
                "Built a deep learning classification model using PyTorch in Python to identify slips, trips, falls, or other events of workers from 15-second accelerometer data to identify potential workplace hazards with 74% precision"
            ]
        },
        {
            "company": "RH",
            "company_url": "https://rh.com/us/en/",
            "role": "Student Data Scientist Consultant",
            "period": "Jan 2022 - May 2022",
            "image": "images/company_logos/rh_logo.svg",
            "tasks": [
                "Forecasted shipping volumes per shipping lane between ports using ARIMA and ETS models per month achieving a cross-validated MAPE score of 47%"
            ]
        },
        {
            "company": "InMobi",
            "company_url": "https://www.inmobi.com/",
            "role": "Business Analyst Intern",
            "period": "Jul 2018 - Dec 2018",
            "image": "images/company_logos/inmobi_logo.png",
            "tasks": [
                "Optimized digital advertising campaigns using demand management techniques, generating $500K in revenue",
                "Introduced automation in the daily reporting routine with VBA programming in Excel increasing productivity by 25%"
            ]
        }
    ],
    "interests": [
        {
            "title": "Hiking",
            "image": "images/edu_interest_imgs/hiking_collage.png",
            "alt": "Hiking collage",
            "description": "I love hiking, trekking, and exploring the great outdoors. There's something truly special about being in nature and experiencing its beauty firsthand. I make sure every weekend I do something outdoorsy, whether it's a long hike or a short nature walk. I want to visit all the famous hiking trails in the world, and I have a long list of places I want to explore. Some of my favorite nature spots yet include the Angels's landing in Zion National Park, Old man of Storr in Scotland, and the Kheerganga trek in the Himalayas."
        },
        {
            "title": "Quizzing",
            "image": "images/edu_interest_imgs/quizzing_collage.png",
            "alt": "Quizzing collage",
            "description": "I got introduced to quizzing by my roommates at BITS and have enjoyed it since. Participating in quiz leagues and trivia nights is always a fun challenge for me. I enjoy the thrill of competing and the joy of learning new facts. Some of my favorite quiz topics include business, science, and pop culture."
        },
        {
            "title": "Cooking",
            "image": "images/edu_interest_imgs/cooking_collage.png",
            "alt": "Cooking collage",
            "description": "Food has a special place in my heart. I enjoy experimenting with new recipes and exploring different cuisines. Cooking is a creative outlet for me, and I love sharing my culinary creations with friends and family. Some of my favorite dishes to make include the staple dal-chawal, chicken tikka, pasta, and traditional Indian curries."
        }
    ],
    "certifications": [
        {
            "title": "Google Data Analytics",
            "link": "https://drive.google.com/file/d/16RJgcWJ-PuaSE5yKrjdNL8EYb7XRu2-b/view?usp=sharing",
            "image": "images/edu_interest_imgs/google_logo.png",
            "alt": "Google Logo",
            "issued": "June 2021"
        },
        {
            "title": "Statistics with R",
            "institution": "Duke University",
            "link": "https://drive.google.com/file/d/1yL-TApfM9fRwI8VXR3CkKPEWeHhWuSJt/view?usp=sharing",
            "image": "images/edu_interest_imgs/duke_logo.png",
            "alt": "Duke University Logo",
            "issued": "April 2020"
        },
        {
            "title": "Business Analytics Specialization",
            "institution": "Wharton Online",
            "link": "https://drive.google.com/file/d/1XeRjBB0-z7Use4eEC7sjngPZHs1Pnh6J/view?usp=drive_link",
            "image": "images/edu_interest_imgs/Wharton_logo.png",
            "alt": "Wharton Online Logo",
            "issued": "March 2019"
        },
        {
            "title": "Machine Learning with Andrew Ng",
            "institution": "Stanford Online",
            "link": "https://drive.google.com/file/d/15p_hVdrubzois8PL2hvYRTUhV4dqUb0S/view?usp=drive_link",
            "image": "images/edu_interest_imgs/Stanford_Logo.png",
            "alt": "Stanford Logo",
            "issued": "October 2018"
        }
    ]
}